//--------------------------------------------------------------------------------
// 
// アプリケーション [app.cpp]
// Author: Taito Jin
// 
//--------------------------------------------------------------------------------

//---------------------------------------------------
// インクルード
//---------------------------------------------------
// core
#include "core/my_app.h"
// game_manager
#include "game_manager/game_manager.h"

//---------------------------------------------------
// コンストラクタ
//---------------------------------------------------
MyApp::MyApp(UINT width, UINT height) : Jing::App(width, height)
{
	/* DO_NOTHING */
}

//---------------------------------------------------
// アプリの初期設定
//---------------------------------------------------
HRESULT MyApp::OnInit()
{
	// ゲームマネージャーの初期設定
	HRESULT hr = GM.Init(GetHInstance(), GetHWnd(), TRUE);
	if (FAILED(hr))
	{
		assert(false && "ゲームマネージャーの初期設定に失敗。");
		return hr;
	}

	return S_OK;
}

//---------------------------------------------------
// アプリの終了処理
//---------------------------------------------------
void MyApp::OnUninit()
{
	// ゲームマネージャーの終了処理
	GM.Uninit();
}

//---------------------------------------------------
// 更新処理
//---------------------------------------------------
void MyApp::OnUpdate(float deltaTime)
{
	// ゲームマネージャーの更新処理
	GM.Update(deltaTime);
}

//---------------------------------------------------
// 描画処理
//---------------------------------------------------
void MyApp::OnDraw()
{
	// ゲームマネージャーの描画処理
	GM.Draw();
}

//---------------------------------------------------
// メッセージ処理
//---------------------------------------------------
void MyApp::OnMsgProc(HWND hWnd, UINT msg, WPARAM wP, LPARAM lP)
{
	// NOTE: ドラッグアンドドロップの有効設定は基底クラスで既に行っています！

	switch (msg)
	{
	case WM_DROPFILES:
	{
		tchar filepath[MAX_PATH] = {};
		DragQueryFile(reinterpret_cast<HDROP>(wP), 0U, &filepath[0], MAX_PATH);
		DragFinish(reinterpret_cast<HDROP>(wP));

	} break;
	}
}
