//--------------------------------------------------------------------------------
// 
// シーンの基底 [scene_base.cpp]
// Author: Taito Jin
// 
//--------------------------------------------------------------------------------

//---------------------------------------------------
// インクルード
//---------------------------------------------------
// scene
#include "scene/scene_base.h"
#include "scene/scene_game.h"
// game_manager
#include "game_manager/game_manager.h"

//---------------------------------------------------
// コンストラクタ
//---------------------------------------------------
SceneBase::SceneBase()
{
	/* DO_NOTHING */
}

//---------------------------------------------------
// 初期設定
//---------------------------------------------------
HRESULT SceneBase::Init()
{
	// カメラの初期設定
	HRESULT hr = m_camera.Init();
	if (FAILED(hr))
	{
		assert(false && "カメラの初期設定に失敗！");
		return E_FAIL;
	}

	return S_OK;
}

//---------------------------------------------------
// 終了処理
//---------------------------------------------------
void SceneBase::Uninit()
{
	// カメラの終了処理
	m_camera.Uninit();
}

//---------------------------------------------------
// 更新処理
//---------------------------------------------------
void SceneBase::Update(float deltaTime)
{
	// カメラの更新
	m_camera.Update(deltaTime);

	// シーンの更新
	UpdateSystem(deltaTime);
}

//---------------------------------------------------
// 描画処理
//---------------------------------------------------
void SceneBase::Draw() const
{
	// カメラの描画
	m_camera.Draw();

	// シーンの描画
	DrawSystem();
}

//---------------------------------------------------
// 次のシーンの設定
//---------------------------------------------------
std::shared_ptr<SceneBase> SceneBase::ChangeScene()
{
	std::cout << "次のシーンがありません！" << std::endl;
	return shared_from_this();
}
